GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/USB/usbd_conf.c
/**
  ******************************************************************************
  * @file    usbd_conf.c
  * @author  MCD Application Team
  * @version V1.4.0
  * @date    26-February-2016
  * @brief   This file implements the USB Device library callbacks and MSP
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics International N.V. 
  * All rights reserved.</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx.h"
#include "stm32l0xx_hal.h"
#include "usbd_def.h"
#include "usbd_core.h"
#include "usbd_desc.h"

#include "armv6m.h"
#include "stm32l0_system.h"
#include "stm32l0_exti.h"
#include "stm32l0_lptim.h"
#include "stm32l0_gpio.h"

void USBD_Detach();

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

#define USBD_STATE_NONE            0
#define USBD_STATE_STARTED         1
#define USBD_STATE_CONNECTED       2
//#define USBD_STATE_SUSPENDED       4

static PCD_HandleTypeDef hpcd_USB;

static uint16_t usbd_pin_vbus;
static uint32_t usbd_mask_vbus;
static bool usbd_wakeup = false;
static bool usbd_enabled = false;
static bool usbd_attached = false;
static uint8_t usbd_state = USBD_STATE_NONE; 
static void (*usbd_connect_callback)(void) = NULL;
static void (*usbd_disconnect_callback)(void) = NULL;
static void (*usbd_suspend_callback)(void) = NULL;
static void (*usbd_resume_callback)(void) = NULL;

/* Private functions ---------------------------------------------------------*/

uint16_t USBD_VendorID;
uint16_t USBD_ProductID;
const uint8_t * USBD_ManufacturerString = NULL;
const uint8_t * USBD_ProductString = NULL;
const uint8_t * USBD_SuffixString = NULL;

static void (*USBD_ClassInitialize)(struct _USBD_HandleTypeDef *pdev) = NULL;

static void (*USBD_IRQHandler)(PCD_HandleTypeDef *hpcd) = NULL;

static USBD_HandleTypeDef USBD_Device;

static stm32l0_lptim_timeout_t USBD_VBUSTimeout;

static void USBD_VBUSTimeoutIrq(void)
{
    unsigned int state;

    state = stm32l0_gpio_pin_read(usbd_pin_vbus);

    if (state)
    {
        usbd_attached = true;

        if (usbd_enabled)
        {
            if (usbd_state == USBD_STATE_NONE)
            {
                usbd_state = USBD_STATE_STARTED;
                
                stm32l0_system_lock(STM32L0_SYSTEM_LOCK_RUN);

                USBD_Init(&USBD_Device, &CDC_MSC_Desc);
                
                (*USBD_ClassInitialize)(&USBD_Device);
                
                USBD_Start(&USBD_Device);

                stm32l0_system_hook(USB_IRQHandler);
            }
        }
    }
}

static void USBD_VBUSChangedIrq(void)
{
    unsigned int state;

    state = stm32l0_gpio_pin_read(usbd_pin_vbus);

    if (state)
    {
        if (!usbd_attached)
        {
            stm32l0_lptim_timeout_start(&USBD_VBUSTimeout, stm32l0_lptim_millis_to_ticks(40), (stm32l0_lptim_callback_t)USBD_VBUSTimeoutIrq); /* 40ms */
        }
    }
    else
    {
        if (!usbd_attached)
        {
            stm32l0_lptim_timeout_stop(&USBD_VBUSTimeout);
        }
        else
        {
            usbd_attached = false;

            if (usbd_state >= USBD_STATE_STARTED)
            {
                stm32l0_system_hook(NULL);

                NVIC_DisableIRQ(USB_IRQn);
                
                USBD_DeInit(&USBD_Device);

                if (usbd_state != USBD_STATE_SUSPENDED)
                {
                    stm32l0_system_unlock(STM32L0_SYSTEM_LOCK_RUN);
                }

                if (usbd_state >= USBD_STATE_CONNECTED)
                {
                    if (usbd_disconnect_callback)
                    {
                        usbd_state = USBD_STATE_NONE;
                        
                        (*usbd_disconnect_callback)();
                    }
                }
                
                usbd_state = USBD_STATE_NONE;
            }
        }
    }
}

bool USBD_Initialize(uint16_t vid, uint16_t pid, const uint8_t *manufacturer, const uint8_t *product, void(*initialize)(struct _USBD_HandleTypeDef *),
                     unsigned int pin_vbus, unsigned int priority,
                     void(*connect_callback)(void), void(*disconnect_callback)(void), void(*suspend_callback)(void), void(*resume_callback)(void))
{
    if (stm32l0_system_pclk1() < 10000000)
    {
        return false;
    }

