GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/USB/usbd_conf.c
    USBD_IRQHandler = HAL_PCD_IRQHandler;

    USBD_VendorID = vid;
    USBD_ProductID = pid;
    USBD_ManufacturerString = manufacturer;
    USBD_ProductString = product;
    USBD_ClassInitialize = initialize;
    
    usbd_pin_vbus = pin_vbus;
    usbd_mask_vbus = 1 << ((pin_vbus & STM32L0_GPIO_PIN_INDEX_MASK) >> STM32L0_GPIO_PIN_INDEX_SHIFT);
    
    /* Set USB Interrupt priority */
    NVIC_SetPriority(USB_IRQn, priority);

    usbd_connect_callback = connect_callback;
    usbd_disconnect_callback = disconnect_callback;
    usbd_suspend_callback = suspend_callback;
    usbd_resume_callback = resume_callback;
    
    stm32l0_lptim_timeout_create(&USBD_VBUSTimeout);

    /* Configure USB FS GPIOs */
    stm32l0_gpio_pin_configure(usbd_pin_vbus, (STM32L0_GPIO_PARK_HIZ | STM32L0_GPIO_PUPD_PULLDOWN | STM32L0_GPIO_OSPEED_LOW | STM32L0_GPIO_OTYPE_PUSHPULL | STM32L0_GPIO_MODE_INPUT));

    if (stm32l0_gpio_pin_read(usbd_pin_vbus))
    {
        stm32l0_lptim_timeout_start(&USBD_VBUSTimeout, stm32l0_lptim_millis_to_ticks(40), (stm32l0_lptim_callback_t)USBD_VBUSTimeoutIrq); /* 40ms */
    }
    
    stm32l0_exti_attach(usbd_pin_vbus,
                        (STM32L0_EXTI_CONTROL_NOWAKEUP | STM32L0_EXTI_CONTROL_PRIORITY_LOW | STM32L0_EXTI_CONTROL_EDGE_RISING | STM32L0_EXTI_CONTROL_EDGE_FALLING),
                        (stm32l0_exti_callback_t)USBD_VBUSChangedIrq, NULL);
    
    return true;
}

void USBD_Teardown()
{
    USBD_Detach();

    stm32l0_exti_detach(usbd_pin_vbus);

    stm32l0_lptim_timeout_stop(&USBD_VBUSTimeout);

    stm32l0_gpio_pin_configure(usbd_pin_vbus, STM32L0_GPIO_MODE_ANALOG);

    usbd_wakeup = false;
    usbd_enabled = false;
    usbd_attached = false;
    usbd_state = USBD_STATE_NONE;
    usbd_connect_callback = NULL;
    usbd_disconnect_callback = NULL;
    usbd_suspend_callback = NULL;
    usbd_resume_callback = NULL;

    USBD_IRQHandler = NULL;
}

void USBD_Attach(void)
{
    if (!usbd_enabled)
    {
        usbd_enabled = true;

        stm32l0_exti_block(usbd_mask_vbus);

        if (usbd_attached)
        {
            usbd_state = USBD_STATE_STARTED;
                
            stm32l0_system_lock(STM32L0_SYSTEM_LOCK_RUN);
            
            USBD_Init(&USBD_Device, &CDC_MSC_Desc);
            
            (*USBD_ClassInitialize)(&USBD_Device);
            
            USBD_Start(&USBD_Device);
        }

        stm32l0_exti_unblock(usbd_mask_vbus);
    }
}

void USBD_Detach(void)
{
    if (usbd_enabled)
    {
        usbd_enabled = false;

        stm32l0_exti_block(usbd_mask_vbus);

        if (usbd_state >= USBD_STATE_STARTED)
        {
            NVIC_DisableIRQ(USB_IRQn);
            
            USBD_DeInit(&USBD_Device);

            if (usbd_state != USBD_STATE_SUSPENDED)
            {
                stm32l0_system_unlock(STM32L0_SYSTEM_LOCK_RUN);
            }
            
            if (usbd_state >= USBD_STATE_CONNECTED)
            {
                if (usbd_disconnect_callback)
                {
                    usbd_state = USBD_STATE_NONE;
                    
                    (*usbd_disconnect_callback)();
                }
            }
                
            usbd_state = USBD_STATE_NONE;
        }

        stm32l0_exti_unblock(usbd_mask_vbus);
        
    }
}

void USBD_Wakeup(void)
{
    if (usbd_state == USBD_STATE_SUSPENDED)
    {
        stm32l0_exti_block(usbd_mask_vbus);

        NVIC_DisableIRQ(USB_IRQn);

        if (USBD_Device.dev_remote_wakeup == 1)
        {
            armv6m_core_udelay(5000);
            
            HAL_PCD_ActivateRemoteWakeup(&hpcd_USB);
            
            armv6m_core_udelay(5000);
            
            HAL_PCD_DeActivateRemoteWakeup(&hpcd_USB);
            
            USBD_Device.dev_remote_wakeup = 0;
        }
        
        NVIC_EnableIRQ(USB_IRQn);

        stm32l0_exti_unblock(usbd_mask_vbus);
    }
}

bool USBD_Attached(void)
{
    return usbd_attached;
}

bool USBD_Connected(void)
{
    return (usbd_state >= USBD_STATE_CONNECTED);
}

bool USBD_Configured(void)
{
    if (usbd_state >= USBD_STATE_CONNECTED)
    {
        return ((USBD_Device.dev_state == USBD_STATE_CONFIGURED) || ((USBD_Device.dev_state == USBD_STATE_SUSPENDED) && (USBD_Device.dev_old_state == USBD_STATE_CONFIGURED)));
    }
    else
    {
        return false;
    }
}

bool USBD_Suspended(void)
{
    return (usbd_state == USBD_STATE_SUSPENDED);
}

void USBD_SetupVBUS(bool wakeup)
{
    if (usbd_wakeup != wakeup)
    {
        usbd_wakeup = wakeup;

        stm32l0_exti_detach(usbd_pin_vbus);
        
        stm32l0_gpio_pin_configure(usbd_pin_vbus,
                                   (usbd_wakeup ? STM32L0_GPIO_PARK_NONE : STM32L0_GPIO_PARK_HIZ) |
                                   (STM32L0_GPIO_PUPD_PULLDOWN | STM32L0_GPIO_OSPEED_LOW | STM32L0_GPIO_OTYPE_PUSHPULL | STM32L0_GPIO_MODE_INPUT));

        stm32l0_exti_attach(usbd_pin_vbus,
                            ((usbd_wakeup ? 0 : STM32L0_EXTI_CONTROL_NOWAKEUP) |
                             (STM32L0_EXTI_CONTROL_PRIORITY_LOW | STM32L0_EXTI_CONTROL_EDGE_RISING | STM32L0_EXTI_CONTROL_EDGE_FALLING)),
                            (stm32l0_exti_callback_t)USBD_VBUSChangedIrq, NULL);
    }
}

/*******************************************************************************
                       PCD BSP Routines
*******************************************************************************/

void USB_IRQHandler(void)
{
    if (USBD_IRQHandler) { (*USBD_IRQHandler)(&hpcd_USB); }
}

/**
  * @brief  Initializes the PCD MSP.
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_MspInit(PCD_HandleTypeDef *hpcd)
{
    stm32l0_system_reference(STM32L0_SYSTEM_REFERENCE_USB);

    stm32l0_system_clk48_enable();
    
    stm32l0_system_periph_enable(STM32L0_SYSTEM_PERIPH_USB);

    armv6m_atomic_or(&EXTI->IMR, EXTI_IMR_IM18);
    
    NVIC_EnableIRQ(USB_IRQn);
}

/**
  * @brief  De-Initializes the PCD MSP.
  * @param  hpcd: PCD handle
  * @retval None
  */
void HAL_PCD_MspDeInit(PCD_HandleTypeDef *hpcd)
{  
    NVIC_DisableIRQ(USB_IRQn);
    
    armv6m_atomic_and(&EXTI->IMR, ~EXTI_IMR_IM18);

